In [1]:
# Import libraries
import pandas as pd

In [3]:
# Create a new df variable (i.e. dataframe) using the budget_data.csv file
df = pd.read_csv('../Resources/budget_data.csv')

# Visualize the top 5 rows of the data frame
df.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

In [4]:
# Add a new column (shift)
df['shift'] = df['Profit/Losses'].shift()
df.head()

       Date  Profit/Losses     shift
0  Jan-2010         867884       NaN
1  Feb-2010         984655  867884.0
2  Mar-2010         322013  984655.0
3  Apr-2010         -69417  322013.0
4  May-2010         310503  -69417.0

In [5]:
# Add a new column (change)
df['change'] = df['Profit/Losses'] - df['shift']
df.head()

       Date  Profit/Losses     shift    change
0  Jan-2010         867884       NaN       NaN
1  Feb-2010         984655  867884.0  116771.0
2  Mar-2010         322013  984655.0 -662642.0
3  Apr-2010         -69417  322013.0 -391430.0
4  May-2010         310503  -69417.0  379920.0

In [6]:
# Calculate the number of months
len(df)

86

In [7]:
# Calculate the average change
df['change'].mean()

-2315.1176470588234

In [10]:
# Set the Date column as the index
df.set_index('Date', inplace=True)

In [11]:
df.head()

          Profit/Losses     shift    change
Date
Jan-2010         867884       NaN       NaN
Feb-2010         984655  867884.0  116771.0
Mar-2010         322013  984655.0 -662642.0
Apr-2010         -69417  322013.0 -391430.0
May-2010         310503  -69417.0  379920.0

In [23]:
maximum_change = df['change'].max()
print(maximum_change)

1926159.0

In [24]:
minimum_change = df['change'].min()
print(minimum_change)

-2196167.0

In [30]:
max_change_month = df['change'].idxmax()
print(max_change_month)

Feb-2012

In [32]:
min_chang_month = df['change'].idxmin()
print(min_chang_month)

Sep-2013

In [72]:
df['Date2'] = df['Date']
df.head()

       Date  Profit/Losses     Date2
0  Jan-2010         867884  Jan-2010
1  Feb-2010         984655  Feb-2010
2  Mar-2010         322013  Mar-2010
3  Apr-2010         -69417  Apr-2010
4  May-2010         310503  May-2010

In [75]:
df.columns  = ['Date', 'Profit/Losses', 'Date3']

In [76]:
df.head()

       Date  Profit/Losses     Date3
0  Jan-2010         867884  Jan-2010
1  Feb-2010         984655  Feb-2010
2  Mar-2010         322013  Mar-2010
3  Apr-2010         -69417  Apr-2010
4  May-2010         310503  May-2010

In [22]:
(df['Profit/Losses'])

0     867884
1     984655
2     322013
3     -69417
4     310503
       ...
81    102685
82    795914
83     60988
84    138230
85    671099
Name: Profit/Losses, Length: 86, dtype: int64

In [23]:
months = list(df['Date'])

In [24]:
len(df)

86

In [25]:
len(months)

86

In [26]:
df

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [27]:
df.DataFrame = Months

NameError: name 'Months' is not defined

In [ ]:
(df['Dates/Profits])

In [ ]:
(df['months'])

In [ ]:
def months_Dates

In [ ]:
d.f (Total_Amount)

In [ ]:
sum(df['Profit/Losses'])

In [ ]:
pd.

In [ ]:
df['Profit/Losses']

In [ ]:
average(Profit/Losses)

In [ ]:
df.mean('Profit/Losses')

In [ ]:
df = pd.DataFrame({df.Months})

In [ ]:
nums = [1,2,34]

In [ ]:
nums[1]

In [ ]:
df['Date'][1]

In [ ]:
sum(df['Profit/Losses'])/len(df['Profit/Losses'])

In [ ]:
df

In [ ]:
max(df["Profit/Losses"])

In [ ]:
min(df['Profit/Losses'])

In [31]:
pl = list(df['Profit/Losses'])

In [ ]:
pl

In [ ]:
pl

In [42]:
for i in 'menes':
    print(i)

m
e
n
e
s

In [ ]:
pl[0]

In [45]:
range(86)

range(0, 86)

In [49]:
changes.append(1200000)

In [50]:
changes

[1, 2, 3, 4]

In [59]:
#find average change
#calculate list of change in profit between each month
#change = 2nd month - 1st month
#make a loop
changes = []
for i in range(len(pl)-1):
    #print(i)
    changes.append(pl[i+1]-pl[i])

In [62]:
sum(changes)/len(changes)

-2315.1176470588234

In [63]:
changes

[116771,
 -662642,
 -391430,
 379920,
 212354,
 510239,
 -428211,
 -821271,
 693918,
 416278,
 -974163,
 860159,
 -1115009,
 1033048,
 95318,
 -308093,
 99052,
 -521393,
 605450,
 231727,
 -65187,
 -702716,
 177975,
 -1065544,
 1926159,
 -917805,
 898730,
 -334262,
 -246499,
 -64055,
 -1529236,
 1497596,
 304914,
 -635801,
 398319,
 -183161,
 -37864,
 -253689,
 403655,
 94168,
 306877,
 -83000,
 210462,
 -2196167,
 1465222,
 -956983,
 1838447,
 -468003,
 -64602,
 206242,
 -242155,
 -449079,
 315198,
 241099,
 111540,
 365942,
 -219310,
 -368665,
 409837,
 151210,
 -110244,
 -341938,
 -1212159,
 683246,
 -70825,
 335594,
 417334,
 -272194,
 -236462,
 657432,
 -211262,
 -128237,
 -1750387,
 925441,
 932089,
 -311434,
 267252,
 -1876758,
 1733696,
 198551,
 -665765,
 693229,
 -734926,
 77242,
 532869]

In [32]:
pl[0-1]

671099

In [33]:
pl[0]

867884

In [34]:
pl[1]

984655

In [ ]:
pl[0]-

In [37]:
867884- 984655

-116771

In [38]:
pl[0]-pl[1]

-116771